# Файл палитры цветов (не для указания ролей).
# Любые названия переменных.
#
# цвета темы: theMe (упорядоченный хаос)
# :
#	base."0" .. base."f" — от чёрного к белому через 16
#	accent.<name> — 8 акцентный цветов
{
	base = {
		"0" = "#060606"; # фон окна, пустота за стеклом
		"1" = "#161616"; # фон кнопок
		"2" = "#262626"; # панельки, статусбары
		"3" = "#363636"; # неактивные границы окон
		"4" = "#464646"; # фон выделенного текста
		"5" = "#565656"; # подсветка текущей строки
		"6" = "#666666"; # комментариии
		"7" = "#767676"; # разделители
		"8" = "#868686"; # отступы
		"9" = "#969696"; # иконки / неактивные вкладки
		"a" = "#a6a6a6"; # второстепенная информация (размер файлов, дата)
		"b" = "#b6b6b6"; # текст статусбара
		"c" = "#c6c6c6"; # почти-основной текст
		"d" = "#d6d6d6"; # основной текст
		"e" = "#e6e6e6"; # выделенный текст
		"f" = "#f6f6f6"; # чистый свет — заголовки
	};

	accent = {
		"0" = "#f69696"; #red
		"1" = "#f6a696";
		"2" = "#f6b696";
		"3" = "#f6c696"; #orange
		"4" = "#f6d696";
		"5" = "#f6e696";
		"6" = "#f6f696"; #yellow
		"7" = "#e6f696";
		"8" = "#d6f696";
		"9" = "#c6f696"; #lime
		"a" = "#b6f696";
		"b" = "#a6f696";
		"c" = "#96f696"; #green
		"d" = "#96f6a6";
		"e" = "#96f6b6";
		"f" = "#96f6c6"; #mint
		"g" = "#96f6d6";
		"h" = "#96f6e6";
		"i" = "#96f6f6"; #cyan
		"j" = "#96e6f6";
		"k" = "#96d6f6";
		"l" = "#96c6f6"; #blue
		"m" = "#96b6f6";
		"n" = "#96a6f6";
		"o" = "#9696f6"; #indigo
		"p" = "#a696f6";
		"q" = "#b696f6";
		"r" = "#c696f6"; #purple
		"s" = "#d696f6";
		"t" = "#e696f6";
		"u" = "#f696f6"; #magenta
		"v" = "#f696e6";
		"w" = "#f696d6";
		"x" = "#f696c6"; #pink
		"y" = "#f696b6";
		"z" = "#f696a6";
	};
}
