# Файл палитры цветов (не для указания ролей).
# Любые названия переменных.
#
# цвета темы: theMe (упорядоченный хаос)
# :
#	base."0" .. base."f" — от чёрного к белому через 16
#	accent.<name> — 8 акцентный цветов
{
	base = {
		"0" = "#060606"; # фон окна, пустота за стеклом
		"1" = "#161616"; # фон кнопок
		"2" = "#262626"; # панельки, статусбары
		"3" = "#363636"; # неактивные границы окон
		"4" = "#464646"; # фон выделенного текста
		"5" = "#565656"; # подсветка текущей строки
		"6" = "#666666"; # комментариии
		"7" = "#767676"; # разделители
		"8" = "#868686"; # отступы
		"9" = "#969696"; # иконки / неактивные вкладки
		"a" = "#a6a6a6"; # второстепенная информация (размер файлов, дата)
		"b" = "#b6b6b6"; # текст статусбара
		"c" = "#c6c6c6"; # почти-основной текст
		"d" = "#d6d6d6"; # основной текст
		"e" = "#e6e6e6"; # выделенный текст
		"f" = "#f6f6f6"; # чистый свет — заголовки
	};

	accent = {
		red = "#f67676";
		orange = "#f6b676";
		yellow = "#f6f676";
		green = "#76f676";
		cyan = "#76f6f6";
		blue = "#76a6f6";
		purple = "#b676f6";
		pink = "#f676b6";
	};
}
