{	
  base00	=	"#161616";	# основной фон (editor, терминал, панели, tmux)
  base01	=	"#262626";	# лёгкий фон (статус-бары, tabline, folded код, вторичные панели)
  base02	=	"#464646";	# фон выделения текста (visual mode, selected text, поиск)
  
  # Серые тона для текста и неактивных элементов
  base03	=	"#969696";	# комментарии, невидимые символы, cursorline, неактивные элементы
  base04	=	"#a6a6a6";	# вторичный/приглушённый текст (statusline, git branch, метки, бордеры)
  
  # Основной и яркий текст
  base05	=	"#d6d6d6";	# основной цвет текста (обычный код, prompt в терминале)
  base06	=	"#e6e6e6";	# bright foreground / special UI
  base07	=	"#f6f6f6";	# самый яркий белый (контрастный текст, bold/bright)
  
	red		=	"#d76667";	#ошибки, удалённое в diff, переменные, XML-теги, предупреждения
	orange	=	"#ff6d66";	#числа, константы, escape-последовательности, пути/URL
	yellow	=	"#fed666";	#классы, структуры, background поиска, WARN, иногда bold
	green	=	"#67b766";	#строки, добавленное в diff, успех
	cyan	=	"#61d6d6";	#типы, специальные конструкции, info, escape в строках
	blue	=	"#0666ff";	#функции, методы, ссылки, основной акцентный цвет
	purple	=	"#a666fd";	# ключевые слова, control flow, операторы, storage
	magenta	=	"#fd66a6";	# deprecated, теги, вставки другого языка, спец-символы	

}
